['CFI_entries', 'EH_CFI_entries', '__class__', '__delattr__', '__dict__', '__doc__', '__format__', '__getattribute__', '__hash__', '__init__', '__module__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_abbrevtable_cache', '_is_supported_version', '_parse_CU_at_offset', '_parse_CUs_iter', '_parse_line_program_at_offset', 'config', 'debug_abbrev_sec', 'debug_aranges_sec', 'debug_frame_sec', 'debug_info_sec', 'debug_line_sec', 'debug_loc_sec', 'debug_ranges_sec', 'debug_str_sec', 'eh_frame_sec', 'get_abbrev_table', 'get_aranges', 'get_string_from_table', 'has_CFI', 'has_EH_CFI', 'has_debug_info', 'iter_CUs', 'line_program_for_CU', 'location_lists', 'range_lists', 'structs']
True
--------------
#1 CU ------------------------------
At offset 11:
DIE DW_TAG_compile_unit, size=26, has_children=True
    |DW_AT_producer    :  AttributeValue(name='DW_AT_producer', form='DW_FORM_strp', value='GNU C11 5.4.0 20160609 -m32 -mtune=generic -march=i686 -g -g -O0 -O0 -fsigned-char -fno-common -fstack-protector-strong', raw_value=1149, offset=12)
    |DW_AT_language    :  AttributeValue(name='DW_AT_language', form='DW_FORM_data1', value=12, raw_value=12, offset=16)
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='sys-utils/zramctl.c', raw_value=693, offset=17)

    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=5, raw_value=5, offset=116)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=56, raw_value=56, offset=117)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=93, raw_value=93, offset=118)

At offset 122:
DIE DW_TAG_typedef, size=11, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='__dev_t', raw_value=558, offset=123)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=5, raw_value=5, offset=127)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=124, raw_value=124, offset=128)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=111, raw_value=111, offset=129)

At offset 133:
DIE DW_TAG_typedef, size=11, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='__off_t', raw_value=14, offset=134)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=5, raw_value=5, offset=138)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=131, raw_value=131, offset=139)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=144, raw_value=144, offset=140)

At offset 144:
DIE DW_TAG_base_type, size=7, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=145)
    |DW_AT_encoding    :  AttributeValue(name='DW_AT_encoding', form='DW_FORM_data1', value=5, raw_value=5, offset=146)
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='long int', raw_value=235, offset=147)

At offset 151:
DIE DW_TAG_typedef, size=11, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='__off64_t', raw_value=1549, offset=152)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=5, raw_value=5, offset=156)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=132, raw_value=132, offset=157)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=100, raw_value=100, offset=158)

At offset 162:
DIE DW_TAG_base_type, size=7, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=163)
    |DW_AT_encoding    :  AttributeValue(name='DW_AT_encoding', form='DW_FORM_data1', value=7, raw_value=7, offset=164)
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='sizetype', raw_value=978, offset=165)

At offset 169:
DIE DW_TAG_pointer_type, size=2, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=170)

At offset 171:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=172)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=177, raw_value=177, offset=173)

At offset 177:
DIE DW_TAG_base_type, size=7, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=1, raw_value=1, offset=178)
    |DW_AT_encoding    :  AttributeValue(name='DW_AT_encoding', form='DW_FORM_data1', value=6, raw_value=6, offset=179)
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='char', raw_value=1310, offset=180)

At offset 184:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=185)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=190, raw_value=190, offset=186)

At offset 190:
DIE DW_TAG_const_type, size=5, has_children=False
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=191)

At offset 195:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=196)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=201, raw_value=201, offset=197)

At offset 201:
DIE DW_TAG_const_type, size=5, has_children=False
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=177, raw_value=177, offset=202)

At offset 206:
DIE DW_TAG_structure_type, size=12, has_children=True
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='option', raw_value=1340, offset=207)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=16, raw_value=16, offset=211)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=6, raw_value=6, offset=212)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=104, raw_value=104, offset=213)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=267, raw_value=267, offset=214)

At offset 218:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='name', raw_value=5014, offset=219)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=6, raw_value=6, offset=223)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=106, raw_value=106, offset=224)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=195, raw_value=195, offset=225)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=0, raw_value=0, offset=229)

At offset 230:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='has_arg', raw_value=1655, offset=231)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=6, raw_value=6, offset=235)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=109, raw_value=109, offset=236)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=237)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=4, raw_value=4, offset=241)

At offset 242:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='flag', raw_value=3064, offset=243)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=6, raw_value=6, offset=247)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=110, raw_value=110, offset=248)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=267, raw_value=267, offset=249)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=8, raw_value=8, offset=253)

At offset 254:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_string', value='val', raw_value='val', offset=255)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=6, raw_value=6, offset=259)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=111, raw_value=111, offset=260)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=261)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=12, raw_value=12, offset=265)

At offset 266:
DIE None, size=1, has_children=None

At offset 267:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=268)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=269)

At offset 273:
DIE DW_TAG_typedef, size=11, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='size_t', raw_value=2147, offset=274)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=7, raw_value=7, offset=278)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=216, raw_value=216, offset=279)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=280)

At offset 284:
DIE DW_TAG_typedef, size=11, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='dev_t', raw_value=560, offset=285)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=8, raw_value=8, offset=289)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=60, raw_value=60, offset=290)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=122, raw_value=122, offset=291)

At offset 295:
DIE DW_TAG_array_type, size=9, has_children=True
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=177, raw_value=177, offset=296)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=311, raw_value=311, offset=300)

At offset 304:
DIE DW_TAG_subrange_type, size=6, has_children=False
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=162, raw_value=162, offset=305)
    |DW_AT_upper_bound :  AttributeValue(name='DW_AT_upper_bound', form='DW_FORM_data1', value=31, raw_value=31, offset=309)

At offset 310:
DIE None, size=1, has_children=None

At offset 311:
DIE DW_TAG_typedef, size=11, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='FILE', raw_value=1068, offset=312)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=9, raw_value=9, offset=316)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=48, raw_value=48, offset=317)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=322, raw_value=322, offset=318)

At offset 322:
DIE DW_TAG_structure_type, size=12, has_children=True
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_FILE', raw_value=1064, offset=323)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=148, raw_value=148, offset=327)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=328)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=241, raw_value=241, offset=329)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=703, raw_value=703, offset=330)

At offset 334:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_flags', raw_value=6403, offset=335)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=339)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=242, raw_value=242, offset=340)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=341)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=0, raw_value=0, offset=345)

At offset 346:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_read_ptr', raw_value=31, offset=347)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=351)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=247, raw_value=247, offset=352)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=353)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=4, raw_value=4, offset=357)

At offset 358:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_read_end', raw_value=295, offset=359)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=363)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=248, raw_value=248, offset=364)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=365)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=8, raw_value=8, offset=369)

At offset 370:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_read_base', raw_value=1559, offset=371)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=375)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=249, raw_value=249, offset=376)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=377)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=12, raw_value=12, offset=381)

At offset 382:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_write_base', raw_value=1865, offset=383)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=387)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=250, raw_value=250, offset=388)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=389)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=16, raw_value=16, offset=393)

At offset 394:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_write_ptr', raw_value=429, offset=395)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=399)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=251, raw_value=251, offset=400)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=401)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=20, raw_value=20, offset=405)

At offset 406:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_write_end', raw_value=1012, offset=407)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=411)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=252, raw_value=252, offset=412)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=413)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=24, raw_value=24, offset=417)

At offset 418:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_buf_base', raw_value=127, offset=419)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=423)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=253, raw_value=253, offset=424)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=425)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=28, raw_value=28, offset=429)

At offset 430:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_buf_end', raw_value=339, offset=431)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=435)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=254, raw_value=254, offset=436)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=437)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=32, raw_value=32, offset=441)

At offset 442:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_save_base', raw_value=827, offset=443)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=447)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=256, raw_value=256, offset=448)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=450)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=36, raw_value=36, offset=454)

At offset 455:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_backup_base', raw_value=163, offset=456)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=460)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=257, raw_value=257, offset=461)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=463)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=40, raw_value=40, offset=467)

At offset 468:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_save_end', raw_value=1579, offset=469)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=473)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=258, raw_value=258, offset=474)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=476)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=44, raw_value=44, offset=480)

At offset 481:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_markers', raw_value=1126, offset=482)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=486)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=260, raw_value=260, offset=487)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=759, raw_value=759, offset=489)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=48, raw_value=48, offset=493)

At offset 494:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_chain', raw_value=44, offset=495)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=499)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=262, raw_value=262, offset=500)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=765, raw_value=765, offset=502)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=52, raw_value=52, offset=506)

At offset 507:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_fileno', raw_value=287, offset=508)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=512)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=264, raw_value=264, offset=513)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=515)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=56, raw_value=56, offset=519)

At offset 520:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_flags2', raw_value=906, offset=521)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=525)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=268, raw_value=268, offset=526)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=528)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=60, raw_value=60, offset=532)

At offset 533:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_old_offset', raw_value=1347, offset=534)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=538)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=270, raw_value=270, offset=539)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=133, raw_value=133, offset=541)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=64, raw_value=64, offset=545)

At offset 546:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_cur_column', raw_value=351, offset=547)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=551)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=274, raw_value=274, offset=552)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=44, raw_value=44, offset=554)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=68, raw_value=68, offset=558)

At offset 559:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_vtable_offset', raw_value=1797, offset=560)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=564)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=275, raw_value=275, offset=565)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=65, raw_value=65, offset=567)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=70, raw_value=70, offset=571)

At offset 572:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_shortbuf', raw_value=78, offset=573)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=577)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=276, raw_value=276, offset=578)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=771, raw_value=771, offset=580)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=71, raw_value=71, offset=584)

At offset 585:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_lock', raw_value=886, offset=586)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=590)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=280, raw_value=280, offset=591)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=787, raw_value=787, offset=593)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=72, raw_value=72, offset=597)

At offset 598:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_offset', raw_value=5868, offset=599)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=603)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=289, raw_value=289, offset=604)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=151, raw_value=151, offset=606)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=76, raw_value=76, offset=610)

At offset 611:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='__pad1', raw_value=1641, offset=612)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=616)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=297, raw_value=297, offset=617)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=169, raw_value=169, offset=619)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=84, raw_value=84, offset=623)

At offset 624:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='__pad2', raw_value=1648, offset=625)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=629)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=298, raw_value=298, offset=630)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=169, raw_value=169, offset=632)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=88, raw_value=88, offset=636)

At offset 637:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='__pad3', raw_value=544, offset=638)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=642)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=299, raw_value=299, offset=643)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=169, raw_value=169, offset=645)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=92, raw_value=92, offset=649)

At offset 650:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='__pad4', raw_value=1663, offset=651)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=655)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=300, raw_value=300, offset=656)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=169, raw_value=169, offset=658)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=96, raw_value=96, offset=662)

At offset 663:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='__pad5', raw_value=1460, offset=664)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=668)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=302, raw_value=302, offset=669)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=273, raw_value=273, offset=671)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=100, raw_value=100, offset=675)

At offset 676:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_mode', raw_value=8199, offset=677)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=681)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=303, raw_value=303, offset=682)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=684)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=104, raw_value=104, offset=688)

At offset 689:
DIE DW_TAG_member, size=13, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_unused2', raw_value=1359, offset=690)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=694)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=305, raw_value=305, offset=695)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=793, raw_value=793, offset=697)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=108, raw_value=108, offset=701)

At offset 702:
DIE None, size=1, has_children=None

At offset 703:
DIE DW_TAG_typedef, size=7, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_lock_t', raw_value=1033, offset=704)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=708)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=150, raw_value=150, offset=709)

At offset 710:
DIE DW_TAG_structure_type, size=12, has_children=True
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_IO_marker', raw_value=584, offset=711)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=12, raw_value=12, offset=715)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=716)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=156, raw_value=156, offset=717)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=759, raw_value=759, offset=718)

At offset 722:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_next', raw_value=5176, offset=723)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=727)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=157, raw_value=157, offset=728)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=759, raw_value=759, offset=729)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=0, raw_value=0, offset=733)

At offset 734:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_sbuf', raw_value=758, offset=735)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=739)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=158, raw_value=158, offset=740)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=765, raw_value=765, offset=741)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=4, raw_value=4, offset=745)

At offset 746:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='_pos', raw_value=3343, offset=747)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=10, raw_value=10, offset=751)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=162, raw_value=162, offset=752)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=753)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=8, raw_value=8, offset=757)

At offset 758:
DIE None, size=1, has_children=None

At offset 759:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=760)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=710, raw_value=710, offset=761)

At offset 765:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=766)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=322, raw_value=322, offset=767)

At offset 771:
DIE DW_TAG_array_type, size=9, has_children=True
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=177, raw_value=177, offset=772)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=787, raw_value=787, offset=776)

At offset 780:
DIE DW_TAG_subrange_type, size=6, has_children=False
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=162, raw_value=162, offset=781)
    |DW_AT_upper_bound :  AttributeValue(name='DW_AT_upper_bound', form='DW_FORM_data1', value=0, raw_value=0, offset=785)

At offset 786:
DIE None, size=1, has_children=None

At offset 787:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=788)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=703, raw_value=703, offset=789)

At offset 793:
DIE DW_TAG_array_type, size=9, has_children=True
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=177, raw_value=177, offset=794)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=809, raw_value=809, offset=798)

At offset 802:
DIE DW_TAG_subrange_type, size=6, has_children=False
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=162, raw_value=162, offset=803)
    |DW_AT_upper_bound :  AttributeValue(name='DW_AT_upper_bound', form='DW_FORM_data1', value=39, raw_value=39, offset=807)

At offset 808:
DIE None, size=1, has_children=None

At offset 809:
DIE DW_TAG_enumeration_type, size=12, has_children=True
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=810)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=811)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=12, raw_value=12, offset=815)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=80, raw_value=80, offset=816)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=864, raw_value=864, offset=817)

At offset 821:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SCOLS_FL_TRUNC', raw_value=1670, offset=822)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=1, raw_value=1, offset=826)

At offset 827:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SCOLS_FL_TREE', raw_value=1846, offset=828)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=2, raw_value=2, offset=832)

At offset 833:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SCOLS_FL_RIGHT', raw_value=723, offset=834)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=4, raw_value=4, offset=838)

At offset 839:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SCOLS_FL_STRICTWIDTH', raw_value=523, offset=840)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=8, raw_value=8, offset=844)

At offset 845:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SCOLS_FL_NOEXTREMES', raw_value=1044, offset=846)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=16, raw_value=16, offset=850)

At offset 851:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SCOLS_FL_HIDDEN', raw_value=1919, offset=852)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=32, raw_value=32, offset=856)

At offset 857:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SCOLS_FL_WRAP', raw_value=1135, offset=858)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=64, raw_value=64, offset=862)

At offset 863:
DIE None, size=1, has_children=None

At offset 864:
DIE DW_TAG_base_type, size=7, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=12, raw_value=12, offset=865)
    |DW_AT_encoding    :  AttributeValue(name='DW_AT_encoding', form='DW_FORM_data1', value=4, raw_value=4, offset=866)
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='long double', raw_value=1476, offset=867)

At offset 871:
DIE DW_TAG_typedef, size=11, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='uint64_t', raw_value=1003, offset=872)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=11, raw_value=11, offset=876)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=58, raw_value=58, offset=877)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=93, raw_value=93, offset=878)

At offset 882:
DIE DW_TAG_typedef, size=11, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='uintmax_t', raw_value=393, offset=883)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=11, raw_value=11, offset=887)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=140, raw_value=140, offset=888)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=93, raw_value=93, offset=889)

At offset 893:
DIE DW_TAG_enumeration_type, size=12, has_children=True
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=894)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=895)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=13, raw_value=13, offset=899)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=98, raw_value=98, offset=900)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=924, raw_value=924, offset=901)

At offset 905:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SIZE_SUFFIX_1LETTER', raw_value=648, offset=906)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=0, raw_value=0, offset=910)

At offset 911:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SIZE_SUFFIX_3LETTER', raw_value=738, offset=912)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=1, raw_value=1, offset=916)

At offset 917:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='SIZE_SUFFIX_SPACE', raw_value=1073, offset=918)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=2, raw_value=2, offset=922)

At offset 923:
DIE None, size=1, has_children=None

At offset 924:
DIE DW_TAG_structure_type, size=12, has_children=True
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='sysfs_cxt', raw_value=713, offset=925)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=40, raw_value=40, offset=929)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=930)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=19, raw_value=19, offset=931)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=1063, raw_value=1063, offset=932)

At offset 936:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='devno', raw_value=6290, offset=937)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=941)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=20, raw_value=20, offset=942)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=284, raw_value=284, offset=943)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=0, raw_value=0, offset=947)

At offset 948:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='dir_fd', raw_value=1026, offset=949)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=953)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=21, raw_value=21, offset=954)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=955)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=8, raw_value=8, offset=959)

At offset 960:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='dir_path', raw_value=818, offset=961)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=965)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=22, raw_value=22, offset=966)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=967)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=12, raw_value=12, offset=971)

At offset 972:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='parent', raw_value=7271, offset=973)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=977)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=23, raw_value=23, offset=978)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=1063, raw_value=1063, offset=979)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=16, raw_value=16, offset=983)

At offset 984:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='scsi_host', raw_value=264, offset=985)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=989)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=25, raw_value=25, offset=990)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=991)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=20, raw_value=20, offset=995)

At offset 996:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='scsi_channel', raw_value=925, offset=997)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=1001)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=26, raw_value=26, offset=1002)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1003)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=24, raw_value=24, offset=1007)

At offset 1008:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='scsi_target', raw_value=1442, offset=1009)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=1013)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=27, raw_value=27, offset=1014)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1015)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=28, raw_value=28, offset=1019)

At offset 1020:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='scsi_lun', raw_value=987, offset=1021)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=1025)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=28, raw_value=28, offset=1026)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1027)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=32, raw_value=32, offset=1031)

At offset 1032:
DIE DW_TAG_member, size=15, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='has_hctl', raw_value=1403, offset=1033)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=1037)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=30, raw_value=30, offset=1038)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1039)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1043)
    |DW_AT_bit_size    :  AttributeValue(name='DW_AT_bit_size', form='DW_FORM_data1', value=1, raw_value=1, offset=1044)
    |DW_AT_bit_offset  :  AttributeValue(name='DW_AT_bit_offset', form='DW_FORM_data1', value=31, raw_value=31, offset=1045)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=36, raw_value=36, offset=1046)

At offset 1047:
DIE DW_TAG_member, size=15, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='hctl_error', raw_value=219, offset=1048)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=14, raw_value=14, offset=1052)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=31, raw_value=31, offset=1053)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1054)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1058)
    |DW_AT_bit_size    :  AttributeValue(name='DW_AT_bit_size', form='DW_FORM_data1', value=1, raw_value=1, offset=1059)
    |DW_AT_bit_offset  :  AttributeValue(name='DW_AT_bit_offset', form='DW_FORM_data1', value=30, raw_value=30, offset=1060)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=36, raw_value=36, offset=1061)

At offset 1062:
DIE None, size=1, has_children=None

At offset 1063:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1064)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=924, raw_value=924, offset=1065)

At offset 1069:
DIE DW_TAG_array_type, size=9, has_children=True
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=1070)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=1085, raw_value=1085, offset=1074)

At offset 1078:
DIE DW_TAG_subrange_type, size=6, has_children=False
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=162, raw_value=162, offset=1079)
    |DW_AT_upper_bound :  AttributeValue(name='DW_AT_upper_bound', form='DW_FORM_data1', value=15, raw_value=15, offset=1083)

At offset 1084:
DIE None, size=1, has_children=None

At offset 1085:
DIE DW_TAG_structure_type, size=12, has_children=True
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='colinfo', raw_value=1505, offset=1086)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=20, raw_value=20, offset=1090)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1091)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=50, raw_value=50, offset=1092)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=1146, raw_value=1146, offset=1093)

At offset 1097:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='name', raw_value=5014, offset=1098)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1102)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=51, raw_value=51, offset=1103)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=195, raw_value=195, offset=1104)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=0, raw_value=0, offset=1108)

At offset 1109:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='whint', raw_value=1573, offset=1110)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1114)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=52, raw_value=52, offset=1115)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=1146, raw_value=1146, offset=1116)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=4, raw_value=4, offset=1120)

At offset 1121:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='flags', raw_value=6404, offset=1122)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1126)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=53, raw_value=53, offset=1127)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=1128)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=12, raw_value=12, offset=1132)

At offset 1133:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='help', raw_value=321, offset=1134)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1138)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=54, raw_value=54, offset=1139)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=195, raw_value=195, offset=1140)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=16, raw_value=16, offset=1144)

At offset 1145:
DIE None, size=1, has_children=None

At offset 1146:
DIE DW_TAG_base_type, size=7, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=8, raw_value=8, offset=1147)
    |DW_AT_encoding    :  AttributeValue(name='DW_AT_encoding', form='DW_FORM_data1', value=4, raw_value=4, offset=1148)
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='double', raw_value=1481, offset=1149)

At offset 1153:
DIE DW_TAG_enumeration_type, size=12, has_children=True
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1154)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1155)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1159)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=57, raw_value=57, offset=1160)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=1238, raw_value=1238, offset=1161)

At offset 1165:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_NAME', raw_value=443, offset=1166)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=0, raw_value=0, offset=1170)

At offset 1171:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_DISKSIZE', raw_value=308, offset=1172)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=1, raw_value=1, offset=1176)

At offset 1177:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_ORIG_SIZE', raw_value=892, offset=1178)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=2, raw_value=2, offset=1182)

At offset 1183:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_COMP_SIZE', raw_value=595, offset=1184)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=3, raw_value=3, offset=1188)

At offset 1189:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_ALGORITHM', raw_value=0, offset=1190)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=4, raw_value=4, offset=1194)

At offset 1195:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_STREAMS', raw_value=1706, offset=1196)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=5, raw_value=5, offset=1200)

At offset 1201:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_ZEROPAGES', raw_value=179, offset=1202)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=6, raw_value=6, offset=1206)

At offset 1207:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_MEMTOTAL', raw_value=326, offset=1208)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=7, raw_value=7, offset=1212)

At offset 1213:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_MEMLIMIT', raw_value=274, offset=1214)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=8, raw_value=8, offset=1218)

At offset 1219:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_MEMUSED', raw_value=511, offset=1220)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=9, raw_value=9, offset=1224)

At offset 1225:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_MIGRATED', raw_value=1429, offset=1226)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=10, raw_value=10, offset=1230)

At offset 1231:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='COL_MOUNTPOINT', raw_value=777, offset=1232)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=11, raw_value=11, offset=1236)

At offset 1237:
DIE None, size=1, has_children=None

At offset 1238:
DIE DW_TAG_enumeration_type, size=12, has_children=True
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1239)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1240)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1244)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=90, raw_value=90, offset=1245)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=1293, raw_value=1293, offset=1246)

At offset 1250:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='MM_ORIG_DATA_SIZE', raw_value=1734, offset=1251)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=0, raw_value=0, offset=1255)

At offset 1256:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='MM_COMPR_DATA_SIZE', raw_value=629, offset=1257)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=1, raw_value=1, offset=1261)

At offset 1262:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='MM_MEM_USED_TOTAL', raw_value=960, offset=1263)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=2, raw_value=2, offset=1267)

At offset 1268:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='MM_MEM_LIMIT', raw_value=680, offset=1269)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=3, raw_value=3, offset=1273)

At offset 1274:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='MM_MEM_USED_MAX', raw_value=1513, offset=1275)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=4, raw_value=4, offset=1279)

At offset 1280:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='MM_ZERO_PAGES', raw_value=1817, offset=1281)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=5, raw_value=5, offset=1285)

At offset 1286:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='MM_NUM_MIGRATED', raw_value=1091, offset=1287)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=6, raw_value=6, offset=1291)

At offset 1292:
DIE None, size=1, has_children=None

At offset 1293:
DIE DW_TAG_structure_type, size=12, has_children=True
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='zram', raw_value=851, offset=1294)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=80, raw_value=80, offset=1298)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1299)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=111, raw_value=111, offset=1300)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=1387, raw_value=1387, offset=1301)

At offset 1305:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='devname', raw_value=8105, offset=1306)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1310)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=112, raw_value=112, offset=1311)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=295, raw_value=295, offset=1312)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=0, raw_value=0, offset=1316)

At offset 1317:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='sysfs', raw_value=5749, offset=1318)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1322)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=113, raw_value=113, offset=1323)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=924, raw_value=924, offset=1324)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=32, raw_value=32, offset=1328)

At offset 1329:
DIE DW_TAG_member, size=12, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='mm_stat', raw_value=1596, offset=1330)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1334)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=114, raw_value=114, offset=1335)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=1387, raw_value=1387, offset=1336)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=72, raw_value=72, offset=1340)

At offset 1341:
DIE DW_TAG_member, size=15, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='mm_stat_probed', raw_value=1604, offset=1342)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1346)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=116, raw_value=116, offset=1347)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1348)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1352)
    |DW_AT_bit_size    :  AttributeValue(name='DW_AT_bit_size', form='DW_FORM_data1', value=1, raw_value=1, offset=1353)
    |DW_AT_bit_offset  :  AttributeValue(name='DW_AT_bit_offset', form='DW_FORM_data1', value=31, raw_value=31, offset=1354)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=76, raw_value=76, offset=1355)

At offset 1356:
DIE DW_TAG_member, size=15, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='control_probed', raw_value=1887, offset=1357)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1361)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=117, raw_value=117, offset=1362)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1363)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1367)
    |DW_AT_bit_size    :  AttributeValue(name='DW_AT_bit_size', form='DW_FORM_data1', value=1, raw_value=1, offset=1368)
    |DW_AT_bit_offset  :  AttributeValue(name='DW_AT_bit_offset', form='DW_FORM_data1', value=30, raw_value=30, offset=1369)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=76, raw_value=76, offset=1370)

At offset 1371:
DIE DW_TAG_member, size=15, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='has_control', raw_value=408, offset=1372)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1376)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=118, raw_value=118, offset=1377)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1378)
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1382)
    |DW_AT_bit_size    :  AttributeValue(name='DW_AT_bit_size', form='DW_FORM_data1', value=1, raw_value=1, offset=1383)
    |DW_AT_bit_offset  :  AttributeValue(name='DW_AT_bit_offset', form='DW_FORM_data1', value=29, raw_value=29, offset=1384)
    |DW_AT_data_member_location:  AttributeValue(name='DW_AT_data_member_location', form='DW_FORM_data1', value=76, raw_value=76, offset=1385)

At offset 1386:
DIE None, size=1, has_children=None

At offset 1387:
DIE DW_TAG_pointer_type, size=6, has_children=False
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1388)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=171, raw_value=171, offset=1389)

At offset 1393:
DIE DW_TAG_enumeration_type, size=13, has_children=True
    |DW_AT_byte_size   :  AttributeValue(name='DW_AT_byte_size', form='DW_FORM_data1', value=4, raw_value=4, offset=1394)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=51, raw_value=51, offset=1395)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=4, raw_value=4, offset=1399)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data2', value=553, raw_value=553, offset=1400)
    |DW_AT_sibling     :  AttributeValue(name='DW_AT_sibling', form='DW_FORM_ref4', value=1437, raw_value=1437, offset=1402)

At offset 1406:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='A_NONE', raw_value=551, offset=1407)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=0, raw_value=0, offset=1411)

At offset 1412:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='A_STATUS', raw_value=22, offset=1413)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=1, raw_value=1, offset=1417)

At offset 1418:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='A_CREATE', raw_value=193, offset=1419)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=2, raw_value=2, offset=1423)

At offset 1424:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='A_FINDONLY', raw_value=1115, offset=1425)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=3, raw_value=3, offset=1429)

At offset 1430:
DIE DW_TAG_enumerator, size=6, has_children=False
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='A_RESET', raw_value=1107, offset=1431)
    |DW_AT_const_value :  AttributeValue(name='DW_AT_const_value', form='DW_FORM_data1', value=4, raw_value=4, offset=1435)

At offset 1436:
DIE None, size=1, has_children=None

At offset 1437:
DIE DW_TAG_subprogram, size=25, has_children=True
    |DW_AT_name        :  AttributeValue(name='DW_AT_name', form='DW_FORM_strp', value='close_stream', raw_value=114, offset=1438)
    |DW_AT_decl_file   :  AttributeValue(name='DW_AT_decl_file', form='DW_FORM_data1', value=1, raw_value=1, offset=1442)
    |DW_AT_decl_line   :  AttributeValue(name='DW_AT_decl_line', form='DW_FORM_data1', value=26, raw_value=26, offset=1443)
    |DW_AT_prototyped  :  AttributeValue(name='DW_AT_prototyped', form='DW_FORM_flag_present', value='', raw_value='', offset=1444)
    |DW_AT_type        :  AttributeValue(name='DW_AT_type', form='DW_FORM_ref4', value=79, raw_value=79, offset=1444)
    |DW_AT_low_pc      :  AttributeValue(name='DW_AT_low_pc', form='DW_FORM_addr', value=134520715, raw_value=134520715, offset=1448)
    |DW_AT_high_pc     :  AttributeValue(name='DW_AT_high_pc', form='DW_FORM_data4', value=154, raw_value=154, offset=1452)
    |DW_AT_frame_base  :  AttributeValue(name='DW_AT_frame_base', form='DW_FORM_exprloc', value=[156], raw_value=[156], offset=1456)
